
function bmi (weight , height) 
{
   height = height / 100
   let value =  weight / height / height
   if(value <= 18){
      
      alert("ตํ่ากว่าเกณฑ์ นํ้าหนักน้อย/ผอม ค่าBMI : " + value.toFixed(2) + "" + "    กด OK ดูผลรวมของร่างกาย");
      document.getElementById("BMI").innerText = "คุณมีค่า BMI ในเกณฑ์ระดับน้ำหนักต่ำกว่ามาตรฐาน มีภาวะความเสี่ยงสูงที่ร่างกายขาดสารอาหารในการหล่อเลี้ยงภายในร่างกายได้ไม่เพียงพอ ส่งผลกระทบให้ร่างกายอ่อนเพลียง่าย ภูมิคุ้มกันพกบร่อง การออกกำลังกายควบคู่กับการรับประทานอาหารที่มีส่วนประกอบโปรตีนสูง จะช่วยทำให้กล้ามเนื้อแข็งแรงและมีสารอาหารมากพอไปซ่อมแซมการทำงานของอวัยวะภายในได้อย่างเพียงพอ"

   }
   else if(value > 18 && value <= 23){

      alert("สมส่วน ปกติ/สุขภาพดี ค่าBMI : " + value.toFixed(2) + "" + "    กด OK ดูผลรวมของร่างกาย");
      document.getElementById("BMI").innerText = "คุณมีค่า BMI อยู่ในเกณฑ์ระดับน้ำหนักตามมาตรฐาน เป็นกลุ่มบุคคลที่มีภาวะเสี่ยงต่อโรคแทรกซ้อนจากโรคอ้วนได้น้อยที่สุด ควรรักษาความสุมดลของค่า BMI ระดับนี้ไว้อย่างสม่ำเสมอ ออกกำลังกาย ดื่มนํ้าวันละ8แก้วหรือ2ลิตร และ ทานอาหารให้ครบ5หมู่"

   }
   else if(value > 23 && value <= 25){

      alert("นํ้าหนักเกินระยะเริ่มต้น ค่าBMI : " + value.toFixed(2) + "" + "    กด OK ดูผลรวมของร่างกาย");
      document.getElementById("BMI").innerText = "คุณมีค่า BMI อยู่ในเกณฑ์ระดับเกินตามมาตรฐาน มีภาวะความเสี่ยงที่เกิดโรคแทรกซ้อนที่เกิดจากโรคอ้วนได้ ควรควบคุมปริมาณไขมันในร่างกายตัวเอง ด้วยการเลือกทานอาหารที่มีโปรตีนสูง หมั่นออกกำลังกาย และพักผ่อนให้เพียงพอตลอดกิจวัตรประจำวัน เพื่อลดระดับไขมันให้กลับมาอยู่ในเกณฑ์มาตรฐาน"

   }
   else if(value > 25 && value <= 30){

      alert("นํ้าหนักเกินมาก/อ้วนระยะเริ่มต้น ค่าBMI : " + value.toFixed(2) + "" + "    กด OK ดูผลรวมของร่างกาย");
      document.getElementById("BMI").innerText = "คุณมีค่า BMI อยู่ในเกณฑ์ระดับเกินตามมาตรฐานมาก มีภาวะความเสี่ยงที่เกิดโรคแทรกซ้อนที่เกิดจากโรคอ้วนได้สูง ควรควบคุมปริมาณไขมันในร่างกายตัวเองแบบเร่งด่วน ด้วยการปรับเปลี่ยนวิถีการกินที่เน้นสุขภาพให้มากขึ้น พร้อมออกกำลังกาย และงดทานของจุบจิบในยามท้องว่าง แล้วดื่มน้ำอย่างต่ำ 8 แก้วต่อวัน พร้อมกับพักผ่อนให้เพียงพอ และติดตามผล BMI ตลอดในช่วงควบคุมน้ำหนัก"

   }
   else if(value > 30){

      alert("นํ้าหนักเกินมากที่สุด/อ้วน ค่าBMI : " + value.toFixed(2) + "" + "    กด OK ดูผลรวมของร่างกาย")
      document.getElementById("BMI").innerText = "คุณมีค่า BMI อยู่ในเกณฑ์ระดับสูงเกินตามมาตรฐานมาก มีภาวะความเสี่ยงที่เกิดโรคแทรกซ้อนที่เกิดจากโรคอ้วนได้สูงที่สุด ควรทำการนัดพบแพทย์เพื่อรับยาในการควบคุมปริมาณน้ำตาลในเลือด พร้อมปรับเปลี่ยนพฤติกรรมการทานให้เป็นอาหารสุขภาพ งดทานอาหารที่เพิ่มมวลไขมันแก่ร่างกาย และหมั่นออกกำลังกายเป็นกิจวัตรประจำวันอย่างสม่ำเสมอ พักผ่อนให้เพียงพอ แล้วดื่มน้ำอย่างต่ำ 10-12 แก้วต่อวัน และติดตามผล BMI ตลอดในช่วงควบคุมน้ำหนัก"

   }


   
  

}



